Run Query: Find all the tracks whose name starts with 'All'. **How many total records there are for this query?**

In [2]:
%sql select name from tracks where name like 'All%' limit 5

 * postgresql://ds22m029:***@mds-dsi-db.postgres.database.azure.com/music-store
5 rows affected.

[('All I Really Want',),
 ('All For You',),
 ('All Star',),
 ('All My Life',),
 ('All My Love',)]

In [3]:
%sql select count(*) from tracks where name like 'All%'

 * postgresql://ds22m029:***@mds-dsi-db.postgres.database.azure.com/music-store
1 rows affected.

[(15,)]

Run Query: Find all the customer emails that start with "J" and are from gmail.com.

In [4]:
%sql select email from customers where email like 'J%' and email like '%gmail.com'

 * postgresql://ds22m029:***@mds-dsi-db.postgres.database.azure.com/music-store
0 rows affected.

[]

Run Query: Find the albums with 12 or more tracks.

In [5]:
%sql select a.title from albums a join tracks t on a.id = t.album_id group by a.title having count(t.id) > 12 limit 5

 * postgresql://ds22m029:***@mds-dsi-db.postgres.database.azure.com/music-store
5 rows affected.

[('Battlestar Galactica, Season 3',),
 ('Elis Regina-Minha História',),
 ('Instant Karma: The Amnesty International Campaign to Save Darfur',),
 ('Judas 0: B-Sides and Rarities',),
 ('Radio Brasil (O Som da Jovem Vanguarda) - Seleccao de Henrique Amaro',)]

Create a list of album titles and the unit prices for the artist "Audioslave".

In [6]:
%sql select alb.title, sum(t.unit_price) from albums alb join tracks t on alb.id = t.album_id join artists art on alb.artist_id = art.id where art.name = 'Audioslave' group by alb.title

 * postgresql://ds22m029:***@mds-dsi-db.postgres.database.azure.com/music-store
3 rows affected.

[('Out Of Exile', Decimal('11.88')),
 ('Audioslave', Decimal('13.86')),
 ('Revelations', Decimal('13.86'))]

Using a subquery, find the names of all the tracks for the album "Californication".

In [7]:
%sql select name from tracks t where t.id in (select a.id from albums a where title = 'Californication')

 * postgresql://ds22m029:***@mds-dsi-db.postgres.database.azure.com/music-store
1 rows affected.

[('Let Me Love You Baby',)]

Find the total number of invoices for each customer along with the customer's full name, city and email.

In [8]:
%sql select count(*), c.first_name, c.last_name, c.city, c.email  from invoices i join customers c on i.customer_id = c.id group by(c.id) limit 5

 * postgresql://ds22m029:***@mds-dsi-db.postgres.database.azure.com/music-store
5 rows affected.

[(7, 'Luís', 'Gonçalves', 'São José dos Campos', 'luisg@embraer.com.br'),
 (7, 'Leonie', 'Köhler', 'Stuttgart', 'leonekohler@surfeu.de'),
 (7, 'François', 'Tremblay', 'Montréal', 'ftremblay@gmail.com'),
 (7, 'Bjørn', 'Hansen', 'Oslo', 'bjorn.hansen@yahoo.no'),
 (7, 'František', 'Wichterlová', 'Prague', 'frantisekw@jetbrains.com')]

After running the query described above, what is the email address of the 5th person, František Wichterlová?

In [9]:
%sql select c.email  from invoices i join customers c on i.customer_id = c.id group by(c.id) OFFSET 4 Limit 1

 * postgresql://ds22m029:***@mds-dsi-db.postgres.database.azure.com/music-store
1 rows affected.

[('frantisekw@jetbrains.com',)]

Retrieve the track name, album, artistID, and trackID for all the albums.

In [17]:
%sql select t.name as track, alb.title as album, art.id as artistID, t.id as trackID from tracks t join albums alb on t.album_id = alb.id join artists art on alb.artist_id = art.id limit 5

 * postgresql://ds22m029:***@mds-dsi-db.postgres.database.azure.com/music-store
5 rows affected.

[('For Those About To Rock (We Salute You)', 'For Those About To Rock We Salute You', 1, 1),
 ('Balls to the Wall', 'Balls to the Wall', 2, 2),
 ('Fast As a Shark', 'Restless and Wild', 2, 3),
 ('Restless and Wild', 'Restless and Wild', 2, 4),
 ('Princess of the Dawn', 'Restless and Wild', 2, 5)]

What is the song title of trackID 12 from the "For Those About to Rock We Salute You" ?

In [11]:
%sql select name from tracks where id = 12

 * postgresql://ds22m029:***@mds-dsi-db.postgres.database.azure.com/music-store
1 rows affected.

[('Breaking The Rules',)]

Retrieve a list with the managers last name, and the last name of the employees who report to him or her. **Who are the reports for the manager named Mitchell?**

In [12]:
%sql select e2.last_name as manager, e1.last_name as employee from employees e1 join employees e2 on e1.reports_to = e2.id where e2.last_name = 'Mitchell'

 * postgresql://ds22m029:***@mds-dsi-db.postgres.database.azure.com/music-store
2 rows affected.

[('Mitchell', 'King'), ('Mitchell', 'Callahan')]

Find the name and ID of the artists who do not have albums.

In [13]:
%sql select art.name, art.id from artists art where art.id not in (select distinct(alb.artist_id) from albums alb) limit 5

 * postgresql://ds22m029:***@mds-dsi-db.postgres.database.azure.com/music-store
5 rows affected.

[('Milton Nascimento & Bebeto', 25),
 ('Azymuth', 26),
 ('João Gilberto', 28),
 ('Bebel Gilberto', 29),
 ('Jorge Vercilo', 30)]

Use a UNION to create a list of all the employee's and customer's first names and last names ordered by the last name in descending order. **Determine what is the last name of the 6th record** Remember to order things in descending order to be sure to get the correct answer.

In [14]:
%sql select emp.first_name, emp.last_name from employees emp union select cus.first_name, cus.last_name from customers cus order by last_name desc limit 5

 * postgresql://ds22m029:***@mds-dsi-db.postgres.database.azure.com/music-store
5 rows affected.

[('Fynn', 'Zimmermann'),
 ('Stanislaw', 'Wójcik'),
 ('František', 'Wichterlová'),
 ('Johannes', 'Van der Berg'),
 ('François', 'Tremblay')]

In [15]:
%sql select emp.last_name from employees emp union select cus.last_name from customers cus order by last_name desc offset 5 limit 1

 * postgresql://ds22m029:***@mds-dsi-db.postgres.database.azure.com/music-store
1 rows affected.

[('Taylor',)]

See if there are any customers who have a different city listed in their billing city versus their customer city.

In [16]:
%sql select count(*) from customers cus join invoices inv on inv.customer_id = cus.id where inv.billing_city != cus.city

 * postgresql://ds22m029:***@mds-dsi-db.postgres.database.azure.com/music-store
1 rows affected.

[(0,)]